<template>
  <div class="righttTeble">
    <tables :tableData="tableData" :tableTitle="tableTitle"></tables>
  </div>
</template>

<script>
import tables from "@/components/Table.vue";
export default {
  components: {
    tables,
  },
  data() {
    const tableData = [
      {
        aaa: "数据1",
        2: "数据2",
        3: "数据3",
        4: "数据4",
        5: "数据5",
        6: "数据6",
        7: "数据7",
      },
      {
        aaa: "数据1",
        2: "数据2",
        3: "数据3",
        4: "数据4",
        5: "数据5",
        6: "数据6",
        7: "数据7",
      },
      {
        aaa: "数据1",
        2: "数据2",
        3: "数据3",
        4: "数据4",
        5: "数据5",
        6: "数据6",
        7: "数据7",
      },
      {
        aaa: "数据1",
        2: "数据2",
        3: "数据3",
        4: "数据4",
        5: "数据5",
        6: "数据6",
        7: "数据7",
      },
      {
        aaa: "数据1",
        2: "数据2",
        3: "数据3",
        4: "数据4",
        5: "数据5",
        6: "数据6",
        7: "数据7",
      },
      {
        aaa: "数据1",
        2: "数据2",
        3: "数据3",
        4: "数据4",
        5: "数据5",
        6: "数据6",
        7: "数据7",
      },
      {
        aaa: "数据1",
        2: "数据2",
        3: "数据3",
        4: "数据4",
        5: "数据5",
        6: "数据6",
        7: "数据7",
      },
      {
        aaa: "数据1",
        2: "数据2",
        3: "数据3",
        4: "数据4",
        5: "数据5",
        6: "数据6",
        7: "数据7",
      },
      {
        aaa: "数据1",
        2: "数据2",
        3: "数据3",
        4: "数据4",
        5: "数据5",
        6: "数据6",
        7: "数据7",
      },
      {
        aaa: "数据1",
        2: "数据2",
        3: "数据3",
        4: "数据4",
        5: "数据5",
        6: "数据6",
        7: "数据7",
      },
      {
        aaa: "数据1",
        2: "数据2",
        3: "数据3",
        4: "数据4",
        5: "数据5",
        6: "数据6",
        7: "数据7",
      },
      {
        aaa: "数据1",
        2: "数据2",
        3: "数据3",
        4: "数据4",
        5: "数据5",
        6: "数据6",
        7: "数据7",
      },
      {
        aaa: "数据1",
        2: "数据2",
        3: "数据3",
        4: "数据4",
        5: "数据5",
        6: "数据6",
        7: "数据7",
      },
      {
        aaa: "数据1",
        2: "数据2",
        3: "数据3",
        4: "数据4",
        5: "数据5",
        6: "数据6",
        7: "数据7",
      },
      {
        aaa: "数据1",
        2: "数据2",
        3: "数据3",
        4: "数据4",
        5: "数据5",
        6: "数据6",
        7: "数据7",
      },
      {
        aaa: "数据1",
        2: "数据2",
        3: "数据3",
        4: "数据4",
        5: "数据5",
        6: "数据6",
        7: "数据7",
      },
      {
        aaa: "数据1",
        2: "数据2",
        3: "数据3",
        4: "数据4",
        5: "数据5",
        6: "数据6",
        7: "数据7",
      },
      {
        aaa: "数据1",
        2: "数据2",
        3: "数据3",
        4: "数据4",
        5: "数据5",
        6: "数据6",
        7: "数据7",
      },
      {
        aaa: "数据1",
        2: "数据2",
        3: "数据3",
        4: "数据4",
        5: "数据5",
        6: "数据6",
        7: "数据7",
      },
      {
        aaa: "数据1",
        2: "数据2",
        3: "数据3",
        4: "数据4",
        5: "数据5",
        6: "数据6",
        7: "数据7",
      },
    ];

    const tableTitle = [
      {
        prop: "aaa",
        label: "bbb",
        // width: "150",
      },
      {
        prop: "2",
        label: "ccc",
        // width: "150",
      },
      {
        prop: "3",
        label: "ddd",
        // width: "150",
      },
      {
        prop: "4",
        label: "eee",
        // width: "150",
      },
      {
        prop: "5",
        label: "fff",
        // width: "150",
      },
      {
        prop: "6",
        label: "ggg",
        // width: "150",
      },
      {
        prop: "7",
        label: "bbb",
        // width: "150",
      },
    ];
    return {
      tableData,
      tableTitle,
    };
  },
};
</script>

<style>
</style>